# RbsEnergyAnalysisGroundPlaneParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisGroundPlaneParam Property
ParameterTypeId Class See Also
---
"Ground Plane"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisGroundPlaneParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisGroundPlaneParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisGroundPlaneParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace